"Welcome to Datashield" = "Welcome to Datashield";
"Phone number" = "หมายเลขโทรศัพท์";
"I have read and agree the service agreement." = "ฉันได้อ่านและยอมรับข้อตกลงการให้บริการแล้ว";
"the service agreement" = "ข้อตกลงการให้บริการแล้ว";
"One-click Login" = "วันคลิกล็อกอิน";
"More login methods" = "วิธีเข้าสู่ระบบแบบอื่นๆ";
"Cancel" = "ยกเลิก";
"Agree" = "ยอมรับ";
"Logging in..." = "กำลังเข้าสู่ระบบ...";
"Please switch to the mobile network and use the one-click login function" = "กรุณาใช้สัญญาณอินเตอร์เน็ตมือถือเพื่อใช้งาน One-click login";
"Data error, please try again" = "เกิดข้อผิดพลาดทางข้อมูล กรุณาลองใหม่อีกครั้ง";
"Network error, please try again later" = "เกิดข้อผิดพลาดในเครือข่าย กรุณาลองใหม่อีกครั้งในภายหลัง" ;

"Login failed, Please choose another login method" = "เข้าสู่ระบบไม่สำเร็จ กรุณาเลือกวิธีเข้าสู่ระบบแบบอื่น";
"The entered phone number is not the current network number" = "หมายเลขโทรศัพท์ที่ป้อนไม่ใช่หมายเลขเครือข่ายปัจจุบัน";
"Please read and agree to the agreement first. I have read and agree to the service agreement" = "กรุณาอ่านและยอมรับข้อตกลงก่อน ฉันได้อ่านและยอมรับข้อตกลงการให้บริการแล้ว";

"Operator ASI" = "ลูกค้ายินยอมให้ DATASHIELD TECHNOLOGY LIMITED เก็บรวบรวมและประมวลผลข้อมูล รวมถึงหมายเลขโทรศัพท์ และอนุญาตให้บริษัท แอดวานซ์ อินโฟร์ เซอร์วิส จำกัด (มหาชน) เปิดเผยข้อมูลดังกล่าวเพื่อใช้ในการยืนยันหมายเลขโทรศัพท์ระหว่างทำธุรกรรม";
"Operator TRUE" = "ลูกค้าอนุญาตให้บริษัท ทรู มูฟ เอช ยูนิเวอร์แซล คอมมิวนิเคชั่น จำกัด (“ทรู”) เปิดเผยข้อมูลส่วนบุคคลแก่ DATASHIELD TECHNOLOGY LIMITED เพื่อการตรวจสอบหมายเลขโทรศัพท์เพียงครั้งเดียว (MSISDN Validation) ลูกค้ารับทราบว่าทรูไม่มีภาระผูกพันในการเก็บรักษาหรือประมวลผลข้อมูลเพิ่มเติม และยืนยันว่าตนยอมรับนโยบายความเป็นส่วนตัวของทรู";
"Operator NT" = "ลูกค้าอนุญาตให้บริษัท โทรคมนาคมแห่งชาติ จำกัด (มหาชน) เปิดเผยข้อมูลส่วนบุคคลแก่ DATASHIELD TECHNOLOGY LIMITED เพื่อวัตถุประสงค์ในการยืนยันหมายเลขโทรศัพท์ (MSISDN) และตำแหน่งในระหว่างทำธุรกรรมเท่านั้น การเปิดเผยข้อมูลครั้งนี้เป็นการเปิดเผยเพียงครั้งเดียวโดยความยินยอมของลูกค้า ซึ่งรับทราบว่าบริษัท โทรคมนาคมแห่งชาติ ไม่มีภาระผูกพันเพิ่มเติมเกี่ยวกับการเก็บรักษาหรือประมวลผลข้อมูล และยืนยันว่าตนยอมรับนโยบายความเป็นส่วนตัวของบริษัทฯ";



